tap 'adoptopenjdk/openjdk'
tap 'buo/cask-upgrade'
tap 'derailed/popeye'
tap 'fluxcd/tap'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/core'
tap 'homebrew/services'
# tap 'jandedobbeleer/oh-my-posh' # Powerlevel10k is better
tap 'jesseduffield/lazydocker'
tap 'koekeishiya/formulae'
tap 'mergestat/mergestat'
tap 'ms-jpq/sad'
tap 'weaveworks/tap'

brew 'act'
brew 'amethyst'
brew 'ansible'
brew 'aom'
brew 'asdf'
brew 'autoconf'
brew 'automake'
brew 'autopep8'
brew 'aws-nuke'
brew 'awscli'
brew 'bash'
brew 'bash-completion'
brew 'bat' # cat/less replacement written in Rust
brew 'borgbackup'
brew 'bottom'
brew 'broot'
brew 'btop'
brew 'catimg' # Image preview in the terminal
brew 'cdparanoia'
brew 'chruby'
brew 'cloc'
brew 'cmake'
brew 'cmatrix'
brew 'code-minimap'
brew 'colima' # For easy local docker https://github.com/abiosoft/colima
brew 'coreutils'
brew 'ctags'
brew 'curl'
brew 'd2' # Diagramming tool https://d2lang.com/
brew 'derailed/popeye/popeye'
brew 'difftastic'
brew 'direnv'
brew 'dive' # https://github.com/wagoodman/dive Docker image inspection
brew 'docker'
brew 'dog' # Modern replacement for dig
brew 'dos2unix'
brew 'dua-cli' # Disk usage analyzer
brew 'duf'
brew 'dust' # du -sh replacement
brew 'elixir-ls'
brew 'exa' # ls replacement
brew 'fastlane'
brew 'fd' # find replacement
brew 'ffmpeg'
brew 'fluxcd/tap/flux', link: false
brew 'flyctl'
brew 'macos-fuse-t/homebrew-cask/fuse-t'
brew 'macos-fuse-t/homebrew-cask/fuse-t-sshfs' # Alternative to the normal sshfs from https://github.com/libfuse/sshfs
brew 'fx'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-absorb' # Also see https://github.com/jesseduffield/lazygit/blob/master/docs/dev/Find_Base_Commit_For_Fixup_Design.md
brew 'git-crypt'
brew 'git-delta' # Git pager
brew 'git-extras'
brew 'git-filter-repo' # Replacement for git-filter-branch
brew 'git-lfs'
brew 'gitui'
brew 'gnu-sed'
brew 'gnupg'
brew 'gnutls'
brew 'go'
brew 'gource' # Git history visualization
brew 'gping' # ping but with a graph
brew 'gradle'
brew 'graphviz'
brew 'grep'
brew 'gum'
brew 'guetzli' # Image optimization
brew 'harfbuzz'
brew 'htop'
# brew 'hyperfine'
brew 'jordanbaird-ice'
brew 'imagemagick'
# brew 'jandedobbeleer/oh-my-posh/oh-my-posh' # Powerlevel10k is better
brew 'jc' # https://github.com/kellyjonbrazil/jc - JSON CLI output
brew 'jesseduffield/lazydocker/lazydocker'
brew 'jpeg-xl'
brew 'jq'
brew 'just'
brew 'k9s'
# brew 'koekeishiya/formulae/yabai' # Tiling window manager (requires to much security permissions)
brew 'kubernetes-cli'
brew 'kubeseal'
brew 'lame'
brew 'less'
brew 'libheif'
brew 'libmagic'
brew 'libpq'
brew 'libyaml'
brew 'lima' # https://github.com/lima-vm/lima
brew 'lnav'
# brew 'loc' # cloc replacement
brew 'lsof'
brew 'lua-language-server'
brew 'luarocks'
brew 'mas' # A command-line interface for the Mac App Store
brew 'mergestat/mergestat/mergestat'
brew 'mosh'
brew 'ms-jpq/sad/sad'
brew 'neovim'
brew 'neovim-remote'
brew 'netcat' # GNU nc - Tutorial: https://blog.ikuamike.io/posts/2021/netcat/
brew 'nmap' # Network Mapper https://nmap.org/
# Other tools:
# - https://github.com/vi/websocat
# - https://linux.die.net/man/1/socat
brew 'nnn' # Terminal file manager
brew 'nvm'
brew 'openjdk'
brew 'openjdk@11'
brew 'openssl@3'
brew 'equinix-labs/otel-cli/otel-cli'
brew 'CtrlSpice/homebrew-otel-desktop-viewer/otel-desktop-viewer'
brew 'pandoc'
brew 'pinentry-mac'
brew 'podman'
brew 'protobuf'
brew 'pyenv'
brew 'pyright'
brew 'python@3.9'
brew 'qrencode'
brew 'rclone'
brew 'readline', link: true
brew 'redis'
brew 'restic' # Backup tool
brew 'ripgrep' # grep replacement, same as rga
brew 'rlwrap'
brew 'rtx' # asdf replacement in Rust
brew 'ruby-install'
brew 'rubyfmt'
brew 'rust-analyzer'
brew 'sniffnet' # Network monitoring tool
brew 'stern' # Tail multiple Kubernets pods and containers
brew 'sqlite'
brew 'switchaudio-osx'
brew 'stylua' # Lua formatter
brew 'FelixKratz/formulae/svim' # SketchyVim: Vim mode for every Mac OS input field
# Maybe check out https://github.com/cknadler/vim-anywhere as an alternative
# OR https://github.com/D00mch/osx-vimr-anywhere
brew 'termscp' # FTP/SCP client with a terminal UI
brew 'terraform-docs'
brew 'terraform-ls' # Terraform language server
brew 'tfenv' # For managing Terraform versions
brew 'tflint' # Terraform linter
brew 'tidy-viewer' # View things nicely formatted in the Terminal, e.g. CSVs
brew 'tig' # Git text interface
brew 'tmux'
brew 'tree'
brew 'urlview' # For tmux URLs selection
brew 'uv' # Python env and package management
brew 'viu' # Image preview in the terminal
brew 'watch'
brew 'watchexec'
brew 'watchman'
brew 'weaveworks/tap/eksctl'
brew 'wget'
brew 'yazi' # Terminal file manager
brew 'youtube-dl'
brew 'yt-dlp'
brew 'zbar' # QR code reader with zbarimg
brew 'zellij'
brew 'zlib'
brew 'zoxide'
brew 'zsh'
brew 'zsh-completions'

# # CLI tools not in Homebrew so far
# chunkwm
# fff
# gron # grep flattenend JSON
# hexyl
# pdftotext
# poppler
# qrencode
# reattach-to-user-namespace # For tmux clipboard sharing
# tesseract
# usql https://github.com/xo/usql
# gpg
# kubectl

cask '1password'
cask 'nikitabobko/tap/aerospace'
cask 'alacritty'
cask 'alfred'
cask 'applite' # Homebrew GUI https://github.com/milanvarady/Applite
cask 'android-commandlinetools'
cask 'android-platform-tools'
cask 'balenaetcher' # Flash USB drives
cask 'bartender' # Somewhat alternative: OnlySwitch https://github.com/jacklandrin/OnlySwitch
cask 'cyberduck'
cask 'darktable'
cask 'eqmac'
cask 'firefox'
cask 'flipper'
cask 'flux'
# cask 'flycut'
cask 'font-fira-mono-nerd-font'
cask 'gitify'
cask 'google-chrome'
cask 'hammerspoon'
cask 'iina' # Video player
cask 'iterm2'
cask 'karabiner-elements'
cask 'keycastr' # Show key presses in the screen
cask 'kitty'
cask 'kiwix'
cask 'knockknock'
cask 'little-snitch'
cask 'macfuse'
cask 'microsoft-auto-update'
cask 'microsoft-office'
cask 'neovide'
cask 'netiquette'
cask 'netnewswire' # RSS reader
# cask 'nextcloud'
cask 'oversight'
cask 'pingid'
cask 'rar'
cask 'rectangle'
cask 'semulov' # Eject menu bar https://github.com/kainjow/Semulov
# cask 'shortcat' Vimium style UI click triggering for Mac OS
cask 'signal'
cask 'sloth'
cask 'spotify'
cask 'stats' # https://github.com/exelban/stats
cask 'sweet-home3d'
cask 'tableplus'
cask 'temurin'
cask 'transmission' # torrent client
cask 'unity-hub'
cask 'utm'
cask 'veracrypt'
cask 'visual-studio-code'
cask 'vlc'
cask 'vmware-fusion'
cask 'webtorrent'
cask 'xbar'
cask 'xld' # X Lossless Decoder - CD ripper
cask 'zenmate-vpn'

# Games
cask 'openemu'
cask 'openra'
cask 'widelands'

# # Casks not in Homebrew so far
# affinity-designer-beta
# betterdisplay
# chromium
# docker
# keepingyouawake # via Hammerspoon
# lulu # Little Snitch alternative
# obsidian # and https://syncthing.net/
# oracle-jdk
# postgres
# postman or insomnia
# sketch
# zoom
# https://github.com/upscayl/upscayl
# https://homerow.app
# https://alt-tab-macos.netlify.app/
# mountain-duck https://mountainduck.io/ for mounting remote filesystems (alternative to sshfs)
